IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/AESADV_1.0.xml
    <register id="AESADV_C_LENGTH_1" width="32" offset="0x1158" description="Crypto data length (MSW)">
        <bitfield id="DATA" description="Bits [60:0] of the crypto length registers (LSW and MSW) store the cryptographic data length in bytes for all modes. Once processing with this context is started, this length decrements to zero. Data lengths up to (261-1) bytes are allowed.
For GCM, any value up to 236-32 bytes can be used. This is because a 32-bit counter mode is used; the maximum number of 128-bit blocks is 232-2, resulting in a maximum number of bytes of 236-32.
A write to this register triggers the engine to start using this context. This is valid for all modes except GCM and CCM.
Note that for the combined modes, this length does not include the authentication only data; the authentication length is specified in the AES_AAD_LENGTH register below.
All modes must have a length &gt; 0. For the combined modes, it is allowed to have one of the lengths equal to zero.
For the basic encryption modes (ECB/CBC/CTR/ICM/CFB/OFB) it is allowed to program zero to the length field; in that case the length is assumed infinite.
All data must be byte (8-bit) aligned for stream cipher modes; bit aligned data streams are not supported. For block cipher modes, the data length must be programmed in multiples of the block cipher size, 16 bytes." begin="28" end="0" width="29" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="AESADV_AAD_LENGTH" width="32" offset="0x115C" description="AAD Data Length">
    </register>
    <register id="AESADV_DATA0" width="32" offset="0x1160" description="Data input (LSW) / Data output (LSW)">
    </register>
    <register id="AESADV_DATA1" width="32" offset="0x1164" description="Data input / Data output">
    </register>
    <register id="AESADV_DATA2" width="32" offset="0x1168" description="Data input / Data output">
    </register>
    <register id="AESADV_DATA3" width="32" offset="0x116C" description="Data input (LSW) / Data output (MSW)">
    </register>
    <register id="AESADV_TAG0" width="32" offset="0x1170" description="Hash result (LSW)">
    </register>
    <register id="AESADV_TAG1" width="32" offset="0x1174" description="Hash result">
    </register>
    <register id="AESADV_TAG2" width="32" offset="0x1178" description="Hash result">
    </register>
    <register id="AESADV_TAG3" width="32" offset="0x117C" description="Hash result (MSW)">
    </register>
    <register id="AESADV_STATUS" width="32" offset="0x1180" description="Status">
        <bitfield id="KEYWR" description="Key write status. 0 - user write to KEY register is allowed. 1 - user write to KEY register is ignored.
In order to allow user write, perform a module reset." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ENABLED" value="0x0" description="User write to KEY MMR is allowed"/>
            <bitenum id="DISABLED" value="0x1" description="User write to KEY MMR is disabled. Writing has no effect."/>
        </bitfield>
    </register>
    <register id="AESADV_DATA_IN" width="32" offset="0x1184" description="Data in alias register">
    </register>
    <register id="AESADV_DATA_OUT" width="32" offset="0x1188" description="Data out alias register">
    </register>
    <register id="AESADV_FORCE_IN_AV" width="32" offset="0x11D0" description="Data control register for input data">
    </register>
    <register id="AESADV_CCM_ALN_WRD" width="32" offset="0x11D4" description="AES-CCM AAD alignment data word">
    </register>
    <register id="AESADV_BLK_CNT0" width="32" offset="0x11D8" description="Internal block counter (LSW)">
    </register>
    <register id="AESADV_BLK_CNT1" width="32" offset="0x11DC" description="Internal block counter (MSW)">
        <bitfield id="DATA" description="Internal block counter for AES GCM and CCM operations.
These bits read the block count value that represents the number of blocks to go. This value is valid with saved_context_ready after a request for an intermediate GCM/CCM digest.
Writing these registers will restore the internal block counter to the programmed value. This only needs to be done to prepare the engine to continue processing of an interrupted GCM or CCM operation.
Also refer to the get_digest and gcm_ccm_continue bits in AES_CTRL register." begin="23" end="0" width="24" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="AESADV_DMA_HS" width="32" offset="0x11F4" description="Control register for DMA handshaking">
        <bitfield id="DMA_DATA_ACK" description="When this bit is 0b, input and output data acknowledge is I/O register based, as specified in the description of the AES_DATA_IN_n / AES_DATA_OUT_n registers.
When this bit is 1b, input and ouput data acknowledge is based on DMA handshake signals." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DMA_DISABLE" value="0x0" description="Disable DMA based data handshake"/>
            <bitenum id="DMA_ENABLE" value="0x1" description="Enables DMA based handshake"/>
        </bitfield>
    </register>
</module>
